/* Initial login prompt for username and password */
"Login {0} with username and password" = "Accesso di {0} con utente e password";

/* Lookup of password in Keychain */
"No login credentials could be found in the Keychain" = "Impossibile trovare le credenziali di login nel Portachiavi";
"The use of the Keychain is disabled in the Preferences" = "L'uso del portachiavi è stato disabilitato nelle preferenze";

/* Password proctected private key for SSH public key authentication */
"Invalid passphrase" = "Password non valida";
"Private key password protected" = "Chiave privata protetta da password";
"Enter the passphrase for the private key file" = "Inserisci la parola d'ordine per il file chiave privata";

"Login canceled" = "Accesso annullato";
"Login failed" = "Accesso fallito";
"Login successful" = "Accesso completato";

/* Private key selection for SSH public key authentication */
"Select the private key in PEM or PuTTY format" = "Seleziona la chiave privata in formato PEM o PuTTY";

/* Challenge-Respone authentication */
"Partial authentication success" = "Riuscita parziale autenticazione";
"Provide additional login credentials" = "Fornisci ulteriori credenziali di accesso";

/* Login prompt placeholders */
"Username" = "Utente";
"Password" = "Password";

/* Warning when credentials are sent using unsecured protocol. Unsecure FTP connection */
"Unsecured {0} connection" = "Connessione {0} non sicura";

/* Credentials sent over plaintext connection */
"{0} will be sent in plaintext." = "{0} verrà inviato in chiaro.";
"Don't show again" = "Non visualizzare nuovamente";
"Continue" = "Continua";
"Disconnect" = "Disconnetti";

/* Protocol switch proposal */
"The server supports encrypted connections. Do you want to switch to {0}?" = "Il server supporta connessioni cifrate. Vuoi passare a {0}?";
"Change" = "Cambia";

/* OAuth2 */
"Paste the authentication code from your web browser" = "Incolla il codice d'autenticazione dal tuo browser web";
"Open web browser to authenticate and obtain an authorization code" = "Aprire il navigatore per fare l'autenticazione e ottenere un codice d'autorizzazione";
"Authentication Code" = "Authentication Code";

"Create a passphrase required to access {0}" = "Creare una frase chiave necessaria per l'accesso {0}";
